{
  "resources": [
    {"class_name": "Action", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Algorithm", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "App", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "AppImageConfig", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Artifact", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Association", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "AutoMLJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "AutoMLJobV2", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "Cluster", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "ClusterSchedulerConfig", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "CodeRepository", "methods": ["create", "get", "update", "delete", "refresh", "get_all", "get_name"]},
    {"class_name": "CompilationJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "ComputeQuota", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Context", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "DataQualityJobDefinition", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "Device", "methods": ["get", "update", "refresh", "get_name"]},
    {"class_name": "DeviceFleet", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Domain", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "EdgeDeploymentPlan", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "EdgePackagingJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "Endpoint", "methods": ["create", "get", "update", "delete", "refresh", "wait", "get_name"]},
    {"class_name": "EndpointConfig", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "Experiment", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "FeatureGroup", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "FeatureMetadata", "methods": ["get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "FlowDefinition", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "Hub", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "HubContent", "methods": ["get", "delete", "refresh", "get_name"]},
    {"class_name": "HubContentReference", "methods": ["get", "delete", "refresh", "get_name"]},
    {"class_name": "HumanTaskUi", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "HyperParameterTuningJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "Image", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "ImageVersion", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "InferenceComponent", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "InferenceExperiment", "methods": ["create", "get", "update", "delete", "refresh", "stop", "get_name"]},
    {"class_name": "InferenceRecommendationsJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "LabelingJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "LineageGroup", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "MlflowTrackingServer", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Model", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "ModelBiasJobDefinition", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "ModelCard", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "ModelCardExportJob", "methods": ["create", "get", "refresh", "get_name"]},
    {"class_name": "ModelExplainabilityJobDefinition", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "ModelPackage", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "ModelPackageGroup", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "ModelQualityJobDefinition", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "MonitoringAlert", "methods": ["get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "MonitoringExecution", "methods": ["get", "delete", "refresh", "stop", "get_name"]},
    {"class_name": "MonitoringSchedule", "methods": ["create", "get", "update", "delete", "refresh", "stop", "get_name"]},
    {"class_name": "NotebookInstance", "methods": ["create", "get", "update", "delete", "refresh", "stop", "get_name"]},
    {"class_name": "NotebookInstanceLifecycleConfig", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "OptimizationJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "PartnerApp", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "Pipeline", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "PipelineExecution", "methods": ["get", "update", "delete", "refresh", "stop", "get_name"]},
    {"class_name": "ProcessingJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "Project", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Space", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "StudioLifecycleConfig", "methods": ["create", "get", "delete", "refresh", "get_name"]},
    {"class_name": "TrainingJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "TransformJob", "methods": ["create", "get", "refresh", "stop", "get_name"]},
    {"class_name": "Trial", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "TrialComponent", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "UserProfile", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Workforce", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]},
    {"class_name": "Workteam", "methods": ["create", "get", "update", "delete", "refresh", "get_name"]}
  ],
  "base_class_methods": [
    "get_sagemaker_client",
    "get_updated_kwargs_with_configured_attributes",
    "populate_chained_attributes",
    "_get_chained_attribute",
    "add_validate_call"
  ]
}
